# SBA Loan Dataset Preprocessed

The following is preprocessed dataset. The dataset will be processed throughout, in which comments will highlight the purpose of the reconstruction

In [1]:
import os 
os.getcwd()

'C:\\Users\\wowan\\OneDrive\\Skrivebord Bærebar\\BigData Exam\\bigdata'

In [2]:
#Changed main directory for .pyt file, in order to sync with GitHub when pushing.
# Modules will be re-installed as following, since we have changed directory for the .lib which includes the modules.
import sys
!{sys.executable} -m pip install pandas

import sys
!{sys.executable} -m pip install numpy

Requirement already satisfied: pandas in c:\users\wowan\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\wowan\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\wowan\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\wowan\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\wowan\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Requirement already satisfied: numpy in c:\users\wowan\anaconda3\lib\site-packages (1.24.3)

In [3]:

#Importing Pandas
import pandas as pd
#Importing Numpy
import numpy as np

#Reading .csv file containing our data
SBAloan_df = pd.read_csv('SBAnational.csv', sep=',', dtype='unicode')

#Displaying data table
SBAloan_df.head()

,LoanNr_ChkDgt,Name,City,State,Zip,Bank,BankState,NAICS,ApprovalDate,ApprovalFY,...,RevLineCr,LowDoc,ChgOffDate,DisbursementDate,DisbursementGross,BalanceGross,MIS_Status,ChgOffPrinGr,GrAppv,SBA_Appv
0,1000014003,ABC HOBBYCRAFT,EVANSVILLE,IN,47711,FIFTH THIRD BANK,OH,451120,28-Feb-97,1997,...,N,Y,NaN,28-Feb-99,"$60,000.00",$0.00,P I F,$0.00,"$60,000.00","$48,000.00"
1,1000024006,LANDMARK BAR & GRILLE (THE),NEW PARIS,IN,46526,1ST SOURCE BANK,IN,722410,28-Feb-97,1997,...,N,Y,NaN,31-May-97,"$40,000.00",$0.00,P I F,$0.00,"$40,000.00","$32,000.00"
2,1000034009,"WHITLOCK DDS, TODD M.",BLOOMINGTON,IN,47401,GRANT COUNTY STATE BANK,IN,621210,28-Feb-97,1997,...,N,N,NaN,31-Dec-97,"$287,000.00",$0.00,P I F,$0.00,"$287,000.00","$215,250.00"
3,1000044001,"BIG BUCKS PAWN & JEWELRY, LLC",BROKEN ARROW,OK,74012,1ST NATL BK & TR CO OF BROKEN,OK,0,28-Feb-97,1997,...,N,Y,NaN,30-Jun-97,"$35,000.00",$0.00,P I F,$0.00,"$35,000.00","$28,000.00"
4,1000054004,"ANASTASIA CONFECTIONS, INC.",ORLANDO,FL,32801,FLORIDA BUS. DEVEL CORP,FL,0,28-Feb-97,1997,...,N,N,NaN,14-May-97,"$229,000.00",$0.00,P I F,$0.00,"$229,000.00","$229,000.00"

In [4]:
#Displaying attributes of the dataset, in order to see which variables relevant or not, for next preparation step.
SBAloan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 899164 entries, 0 to 899163
Data columns (total 27 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   LoanNr_ChkDgt      899164 non-null  object
 1   Name               899150 non-null  object
 2   City               899134 non-null  object
 3   State              899150 non-null  object
 4   Zip                899164 non-null  object
 5   Bank               897605 non-null  object
 6   BankState          897598 non-null  object
 7   NAICS              899164 non-null  object
 8   ApprovalDate       899164 non-null  object
 9   ApprovalFY         899164 non-null  object
 10  Term               899164 non-null  object
 11  NoEmp              899164 non-null  object
 12  NewExist           899028 non-null  object
 13  CreateJob          899164 non-null  object
 14  RetainedJob        899164 non-null  object
 15  FranchiseCode      899164 non-null  object
 16  UrbanRural         899164 non-null  object
 17  RevLineCr          894636 non-null  object
 18  LowDoc             896582 non-null  object
 19  ChgOffDate         162699 non-null  object
 20  DisbursementDate   896796 non-null  object
 21  DisbursementGross  899164 non-null  object
 22  BalanceGross       899164 non-null  object
 23  MIS_Status         897167 non-null  object
 24  ChgOffPrinGr       899164 non-null  object
 25  GrAppv             899164 non-null  object
 26  SBA_Appv           899164 non-null  object
dtypes: object(27)
memory usage: 185.2+ MB

In [5]:
#As we can see, we have 27 variables and they're all type "object". It is not nessecary to have all these variables, and we will there
#-fore need, to drop some.

# # Attribute clearing and dropping in dataset

In [6]:
#From the attribution column, we can see there are many un-usefull variables, that will only cause noise in preparation for the data.
#Therefore initiating drop command, to remove these from our dataset, and cleaning it up


SBAloan_df = SBAloan_df.drop(columns=['CreateJob','RetainedJob','Zip','City','ChgOffDate','LoanNr_ChkDgt','Name','ApprovalDate','GrAppv','DisbursementDate','BalanceGross','ChgOffPrinGr','SBA_Appv','Bank','RevLineCr'])

In [7]:
#Now displaying our data, after dropping variables
SBAloan_df.info()
SBAloan_df.head()

#We can see, that we're left with 12 variables.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 899164 entries, 0 to 899163
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   State              899150 non-null  object
 1   BankState          897598 non-null  object
 2   NAICS              899164 non-null  object
 3   ApprovalFY         899164 non-null  object
 4   Term               899164 non-null  object
 5   NoEmp              899164 non-null  object
 6   NewExist           899028 non-null  object
 7   FranchiseCode      899164 non-null  object
 8   UrbanRural         899164 non-null  object
 9   LowDoc             896582 non-null  object
 10  DisbursementGross  899164 non-null  object
 11  MIS_Status         897167 non-null  object
dtypes: object(12)
memory usage: 82.3+ MB

,State,BankState,NAICS,ApprovalFY,Term,NoEmp,NewExist,FranchiseCode,UrbanRural,LowDoc,DisbursementGross,MIS_Status
0,IN,OH,451120,1997,84,4,2,1,0,Y,"$60,000.00",P I F
1,IN,IN,722410,1997,60,2,2,1,0,Y,"$40,000.00",P I F
2,IN,IN,621210,1997,180,7,1,1,0,N,"$287,000.00",P I F
3,OK,OK,0,1997,60,2,1,1,0,Y,"$35,000.00",P I F
4,FL,FL,0,1997,240,14,1,1,0,N,"$229,000.00",P I F

# # Fitting dataset to relevant years

In [8]:
#As seen the columns are all objects. Instead, we want to convert the relevant onces into integers, in order to 
#- use the data later on.

SBAloan_df["ApprovalFY"] = pd.to_numeric(SBAloan_df["ApprovalFY"], errors='coerce')
SBAloan_df["Term"] = pd.to_numeric(SBAloan_df["Term"], errors='coerce')
SBAloan_df["NoEmp"] = pd.to_numeric(SBAloan_df["NoEmp"], errors='coerce')
SBAloan_df["NewExist"] = pd.to_numeric(SBAloan_df["NewExist"], errors='coerce')
SBAloan_df["FranchiseCode"] = pd.to_numeric(SBAloan_df["FranchiseCode"], errors='coerce')
SBAloan_df["UrbanRural"] = pd.to_numeric(SBAloan_df["UrbanRural"], errors='coerce')
SBAloan_df["NAICS"] = pd.to_numeric(SBAloan_df["NAICS"], errors='coerce')

#If we receive an error (because of Not a Number value), we will drop it with the coerce command.
SBAloan_df["ApprovalFY"].dropna()

SBAloan_df.info()
SBAloan_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 899164 entries, 0 to 899163
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   State              899150 non-null  object
 1   BankState          897598 non-null  object
 2   NAICS              899164 non-null  int64
 3   ApprovalFY         899146 non-null  float64
 4   Term               899164 non-null  int64
 5   NoEmp              899164 non-null  int64
 6   NewExist           899028 non-null  float64
 7   FranchiseCode      899164 non-null  int64
 8   UrbanRural         899164 non-null  int64
 9   LowDoc             896582 non-null  object
 10  DisbursementGross  899164 non-null  object
 11  MIS_Status         897167 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 82.3+ MB

,State,BankState,NAICS,ApprovalFY,Term,NoEmp,NewExist,FranchiseCode,UrbanRural,LowDoc,DisbursementGross,MIS_Status
0,IN,OH,451120,1997.0,84,4,2.0,1,0,Y,"$60,000.00",P I F
1,IN,IN,722410,1997.0,60,2,2.0,1,0,Y,"$40,000.00",P I F
2,IN,IN,621210,1997.0,180,7,1.0,1,0,N,"$287,000.00",P I F
3,OK,OK,0,1997.0,60,2,1.0,1,0,Y,"$35,000.00",P I F
4,FL,FL,0,1997.0,240,14,1.0,1,0,N,"$229,000.00",P I F

In [9]:
#Checking for NaN instances
SBAloan_df.isna().sum()


#If NaN occures it will be filled with value 0
SBAloan_df["ApprovalFY"] = SBAloan_df["ApprovalFY"].fillna(0).round().astype(np.int64)

print(SBAloan_df.head())

  State BankState   NAICS  ApprovalFY  Term  NoEmp  NewExist  FranchiseCode  \
0    IN        OH  451120        1997    84      4       2.0              1
1    IN        IN  722410        1997    60      2       2.0              1
2    IN        IN  621210        1997   180      7       1.0              1
3    OK        OK       0        1997    60      2       1.0              1
4    FL        FL       0        1997   240     14       1.0              1

   UrbanRural LowDoc DisbursementGross MIS_Status
0           0      Y       $60,000.00       P I F
1           0      Y       $40,000.00       P I F
2           0      N      $287,000.00       P I F
3           0      Y       $35,000.00       P I F
4           0      N      $229,000.00       P I F

In [10]:
#In order to reduce the dataset we have chosen to take the years 2007-2014 into account.

SBAloan_df = SBAloan_df.drop(SBAloan_df[(SBAloan_df["ApprovalFY"]<2007)| (SBAloan_df["ApprovalFY"] > 2014)].index)
SBAloan_df.info()

SBAloan_df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 168721 entries, 143841 to 896097
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   State              168721 non-null  object
 1   BankState          168720 non-null  object
 2   NAICS              168721 non-null  int64
 3   ApprovalFY         168721 non-null  int64
 4   Term               168721 non-null  int64
 5   NoEmp              168721 non-null  int64
 6   NewExist           168585 non-null  float64
 7   FranchiseCode      168721 non-null  int64
 8   UrbanRural         168721 non-null  int64
 9   LowDoc             166142 non-null  object
 10  DisbursementGross  168721 non-null  object
 11  MIS_Status         168346 non-null  object
dtypes: float64(1), int64(6), object(5)
memory usage: 16.7+ MB

,State,BankState,NAICS,ApprovalFY,Term,NoEmp,NewExist,FranchiseCode,UrbanRural,LowDoc,DisbursementGross,MIS_Status
143841,NC,NC,453998,2007,60,6,1.0,0,1,N,"$79,500.00",P I F
143842,NJ,DE,448190,2007,60,1,2.0,0,1,N,"$35,000.00",P I F
143845,NJ,DE,448190,2007,78,1,2.0,0,1,N,"$39,737.00",P I F
143846,CA,VA,423930,2007,58,20,1.0,0,1,N,"$100,000.00",CHGOFF
143851,VT,VT,517910,2007,13,3,1.0,0,2,N,"$50,000.00",P I F

In [11]:
#Again removing any missing columns with either NaN or null values, for our filtered data.

SBAloan_df.dropna()
SBAloan_df.dropna(inplace=True)
SBAloan_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 165639 entries, 143841 to 896097
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   State              165639 non-null  object
 1   BankState          165639 non-null  object
 2   NAICS              165639 non-null  int64
 3   ApprovalFY         165639 non-null  int64
 4   Term               165639 non-null  int64
 5   NoEmp              165639 non-null  int64
 6   NewExist           165639 non-null  float64
 7   FranchiseCode      165639 non-null  int64
 8   UrbanRural         165639 non-null  int64
 9   LowDoc             165639 non-null  object
 10  DisbursementGross  165639 non-null  object
 11  MIS_Status         165639 non-null  object
dtypes: float64(1), int64(6), object(5)
memory usage: 16.4+ MB

# # Configuring each variable to fit the model

### Variable: DisbursementGross

In [12]:
#DisbursementGross variable contains value in dollars, which we want to remove, in order to work on the data
#We start doing this by converting the variable intro a string
#Source https://pbpython.com/currency-cleanup.html

SBAloan_df['DisbursementGross'] = SBAloan_df["DisbursementGross"].astype("string")
SBAloan_df.info()

#Now removing the dollar sign
SBAloan_df['DisbursementGross'] = SBAloan_df['DisbursementGross'].str.replace('$','', regex=True)
SBAloan_df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 165639 entries, 143841 to 896097
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   State              165639 non-null  object
 1   BankState          165639 non-null  object
 2   NAICS              165639 non-null  int64
 3   ApprovalFY         165639 non-null  int64
 4   Term               165639 non-null  int64
 5   NoEmp              165639 non-null  int64
 6   NewExist           165639 non-null  float64
 7   FranchiseCode      165639 non-null  int64
 8   UrbanRural         165639 non-null  int64
 9   LowDoc             165639 non-null  object
 10  DisbursementGross  165639 non-null  string
 11  MIS_Status         165639 non-null  object
dtypes: float64(1), int64(6), object(4), string(1)
memory usage: 16.4+ MB

,State,BankState,NAICS,ApprovalFY,Term,NoEmp,NewExist,FranchiseCode,UrbanRural,LowDoc,DisbursementGross,MIS_Status
143841,NC,NC,453998,2007,60,6,1.0,0,1,N,"79,500.00",P I F
143842,NJ,DE,448190,2007,60,1,2.0,0,1,N,"35,000.00",P I F
143845,NJ,DE,448190,2007,78,1,2.0,0,1,N,"39,737.00",P I F
143846,CA,VA,423930,2007,58,20,1.0,0,1,N,"100,000.00",CHGOFF
143851,VT,VT,517910,2007,13,3,1.0,0,2,N,"50,000.00",P I F

In [13]:
#Now removing the space which has replaced the dollar sign

SBAloan_df['DisbursementGross'] = SBAloan_df['DisbursementGross'].str.replace(' ','', regex=True)
SBAloan_df.head()

,State,BankState,NAICS,ApprovalFY,Term,NoEmp,NewExist,FranchiseCode,UrbanRural,LowDoc,DisbursementGross,MIS_Status
143841,NC,NC,453998,2007,60,6,1.0,0,1,N,"79,500.00",P I F
143842,NJ,DE,448190,2007,60,1,2.0,0,1,N,"35,000.00",P I F
143845,NJ,DE,448190,2007,78,1,2.0,0,1,N,"39,737.00",P I F
143846,CA,VA,423930,2007,58,20,1.0,0,1,N,"100,000.00",CHGOFF
143851,VT,VT,517910,2007,13,3,1.0,0,2,N,"50,000.00",P I F

In [17]:
#Now removing the thousandsseparator and the two last digits (decimals)

SBAloan_df['DisbursementGross'] = SBAloan_df['DisbursementGross'].str.replace(',', '', regex=True)

SBAloan_df['DisbursementGross'] = SBAloan_df['DisbursementGross'].str.replace('.', '', regex=True)

#Removing the decimals, by slicing in the string
#source https://stackoverflow.com/questions/15535205/what-does-1-mean-do-in-python

SBAloan_df['DisbursementGross'] = SBAloan_df['DisbursementGross'].str[:-2]

#Displaying data
SBAloan_df.head()

,State,BankState,NAICS,ApprovalFY,Term,NoEmp,NewExist,FranchiseCode,UrbanRural,LowDoc,DisbursementGross,MIS_Status
143841,NC,NC,453998,2007,60,6,1.0,0,1,N,79500,P I F
143842,NJ,DE,448190,2007,60,1,2.0,0,1,N,35000,P I F
143845,NJ,DE,448190,2007,78,1,2.0,0,1,N,39737,P I F
143846,CA,VA,423930,2007,58,20,1.0,0,1,N,100000,CHGOFF
143851,VT,VT,517910,2007,13,3,1.0,0,2,N,50000,P I F

In [19]:
#Now we have to convert the string into integer, after we have sliced.

SBAloan_df['DisbursementGross'] = SBAloan_df['DisbursementGross'].astype(np.int64)
SBAloan_df.info()
SBAloan_df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 165639 entries, 143841 to 896097
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   State              165639 non-null  object
 1   BankState          165639 non-null  object
 2   NAICS              165639 non-null  int64
 3   ApprovalFY         165639 non-null  int64
 4   Term               165639 non-null  int64
 5   NoEmp              165639 non-null  int64
 6   NewExist           165639 non-null  float64
 7   FranchiseCode      165639 non-null  int64
 8   UrbanRural         165639 non-null  int64
 9   LowDoc             165639 non-null  object
 10  DisbursementGross  165639 non-null  int64
 11  MIS_Status         165639 non-null  object
dtypes: float64(1), int64(7), object(4)
memory usage: 16.4+ MB

,State,BankState,NAICS,ApprovalFY,Term,NoEmp,NewExist,FranchiseCode,UrbanRural,LowDoc,DisbursementGross,MIS_Status
143841,NC,NC,453998,2007,60,6,1.0,0,1,N,79500,P I F
143842,NJ,DE,448190,2007,60,1,2.0,0,1,N,35000,P I F
143845,NJ,DE,448190,2007,78,1,2.0,0,1,N,39737,P I F
143846,CA,VA,423930,2007,58,20,1.0,0,1,N,100000,CHGOFF
143851,VT,VT,517910,2007,13,3,1.0,0,2,N,50000,P I F

### Variable: Franchise